import type { IntroducePayload } from "@/components/introduce/Introduce";

const payload: IntroducePayload[] = [
  "사용자의 문제를 해결하며 더 나은 경험을 전달하고자 하는, 5년차 프론트엔드 개발자 김윤지입니다. 주로 React와 Typescript를 기반으로 스타트업에서 여러 웹 서비스를 개발해 왔습니다. 직관적인 인터페이스와 사용자 경험에 집중하고, 개발자 경험을 고려한 코드와 아키텍처에 대해 지속적으로 고민하고 있습니다. 3D 드로잉 서비스에서는 상태 복원 과정을 최적화해 진입 속도를 30% 단축시켜 UX를 개선하고, 프로젝트의 아키텍처 개선을 주도했습니다.",
  "팀의 목표를 달성하기 위해서는 원활한 커뮤니케이션이 중요하다고 생각합니다. 좋은 결과를 만들어가는 과정이라 여기고 문제 해결과 개발을 위해 적극적인 소통을 지향합니다. 이와 함께, 서로가 목표에 집중하며 협업하고 함께 성장할 수 있는 환경을 조성하는 것에 관심이 있습니다. 작은 팀의 리드를 맡게 되어 개발 문화를 조성하거나, 스크럼을 도입하고 스프린트를 진행하여 개발 프로세스를 개선한 경험이 있습니다.",
  "성장을 위해 지속적으로 경험하고 있습니다. 최근에는 Next.js의 SSR 구조에 대해 알아가고 있으며, 기록하는 습관을 기르기 위해 블로그를 시작하여 경험을 정리해보고 있습니다. 또한, 주간 다운로드 약 3만 회의 오픈 소스 라이브러리 ‘react-daum-postcode’의 메인테이너로 활동하며 유지보수 및 이슈 대응을 맡고 있습니다.",
  "‘의미 없는 코드는 없다’는 마음가짐으로 코드를 작성하려 하고, 작성한 코드가 사용자에게 가치를 제공할 때 큰 보람을 느낍니다. 이를 바탕으로 계속해서 노력하고 경험하며, 더 다양한 가치를 전달할 수 있는 개발자가 되고자 합니다."
];

export default payload;
